app/views/users/calendar.html.erb

SELECT "entries".* FROM "entries" WHERE "entries"."day" = ?  [["day", Sat, 01 Apr 2017]]
---
                    <%= month_calendar do |date| %>
                    	<%lookup = Entry.where(day: date) %>