app/views/pages/about.html.erb


<p>Number of Registered Users: <%=User.count%></p>
---
SELECT COUNT(*) FROM "users"