app/controllers/entries_controller.rb

	def show
		@entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

	def create
		if params[:entry][:day].blank?
			redirect_to '/users/index'
			return
		end
		lookup = current_user.entries.where(day: params[:entry][:day])
---
SELECT "entries".* FROM "entries" WHERE "entries"."day" = ?  [["day", nil]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."day" = ?  [["user_id", 2], ["day", Sun, 23 Apr 2017]]


		@entry.user_id = current_user.id

		@entry.save
---
INSERT INTO "entries" ("day", "sleep_hours", "bedtime", "getuptime", "created_at", "updated_at", "notes") VALUES (?, ?, ?, ?, ?, ?, ?)  [["day", Wed, 19 Apr 2017], ["sleep_hours", 8], ["bedtime", "9pm"], ["getuptime", ""], ["created_at", 2017-04-20 05:59:00 UTC], ["updated_at", 2017-04-20 05:59:00 UTC], ["notes", ""]]
UPDATE "entries" SET "sleep_hours" = ?, "bedtime" = ?, "getuptime" = ?, "sleep_onset" = ?, "wakefulness" = ?, "awakenings" = ?, "time_awake" = ?, "caffiene" = ?, "alcohol" = ?, "naptime" = ?, "exercise" = ?, "sleepiness" = ?, "notes" = ?, "updated_at" = ? WHERE "entries"."id" = ?